app/views/papers/edit.html.erb

SELECT "authors"."id" FROM "authors" INNER JOIN "authors_papers" ON "authors"."id" = "authors_papers"."author_id" WHERE "authors_papers"."paper_id" = ?  [["paper_id", 2]]
---
  <p>
  <%= form.select 'author_ids',
  options_from_collection_for_select(Author.all, :id, :name, @paper.author_ids),
  {},
  multiple: true, size: 10 %>