app/views/papers/show.html.erb

SELECT "authors".* FROM "authors" INNER JOIN "authors_papers" ON "authors"."id" = "authors_papers"."author_id" WHERE "authors_papers"."paper_id" = ?  [["paper_id", 1]]
---
<h3>Author:</h3>
<%= @paper.authors.each do |author| %>