app/controllers/authors_controller.rb

    def show
        #rails passes all @ instance var to the view
        @author = Author.find(params[:id])
---
SELECT "authors".* FROM "authors" WHERE "authors"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

    def create
        @author = Author.new(article_params)
        if @author.save
---
INSERT INTO "authors" ("first_name", "last_name", "homepage", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["first_name", "ALAN"], ["last_name", "TURONG"], ["homepage", "SDAFASD"], ["created_at", "2022-11-01 16:49:35.070962"], ["updated_at", "2022-11-01 16:49:35.070962"]]

    def update
        @author = Author.find(params[:id])
        if @author.update(article_params)
---
SELECT "authors".* FROM "authors" WHERE "authors"."id" = ? LIMIT ?  [["id", nil], ["LIMIT", 1]]
UPDATE "authors" SET "first_name" = ?, "last_name" = ?, "updated_at" = ? WHERE "authors"."id" = ?  [["first_name", "asdfasd"], ["last_name", "Mo"], ["updated_at", "2022-11-02 12:52:36.715387"], ["id", 4]]

    def destroy
        @author = Author.find(params[:id])
        @author.destroy
---
SELECT "authors".* FROM "authors" WHERE "authors"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
DELETE FROM "authors" WHERE "authors"."id" = ?  [["id", 2]]